pmo-dataset/graphviz/42.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Rate Service\nFacility" -> "Repair process over";
  "Confirm that fridge\nis okay" -> "Submit a rating?";
  "Send a report to the\nfridge service\ncenter" -> "Select local service\nfacility";
  "Schedule an\nappointment for\nfridge repair" -> "Wait until service\nfacility arrives";
  "Wait until service\nfacility arrives" -> "Repair the fridge";
  "Repair the fridge" -> "Additional parts\nneeded?";
  "Select local service\nfacility" -> "ExclusiveGateway";
  "ExclusiveGateway" -> "Schedule an\nappointment for\nfridge repair";
  "ParallelGateway_1" -> "Describe the\nsymptoms";
  "ParallelGateway_1" -> "Collect fridge type\ndata";
  "Additional parts\nneeded?" -> "Confirm that fridge\nis okay" [label="No. Fridge is\nrepaired"];
  "Submit a rating?" -> "Rate Service\nFacility" [label="Yes"];
  "Collect fridge type\ndata" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "Send a report to the\nfridge service\ncenter";
  "Describe the\nsymptoms" -> "ParallelGateway_2";
  "Fridge makes strange\nnoises" -> "ParallelGateway_1";
  "Submit a rating?" -> "Repair process over" [label="No"];
  "Additional parts\nneeded?" -> "ExclusiveGateway" [label="Yes. Fridge is not\nrepaired"];

  "Fridge makes strange\nnoises" [shape=circle];
  "Repair process over" [shape=circle, penwidth=4];
  "Wait until service\nfacility arrives" [shape=doublecircle];
  "Submit a rating?" [shape=diamond];
  "Additional parts\nneeded?" [shape=diamond];
  "ExclusiveGateway" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
}
